Repository: CERT-Polska/Artemis
Catalog: artemis/reporting/modules/bruter/translations/*/LC_MESSAGES/messages.po
Languages: pl_pl

source: The following addresses contain archives:
pl_pl: Pod następującymi adresami znajdują się archiwa:

source: Please verify that these archives don't contain data such as website backup and whether they should be publicly available.
pl_pl: Prosimy o weryfikację, czy te archiwa nie zawierają danych takich jak np. kopia zapasowa serwisu i czy powinny być dostępne publicznie.

source: The following addresses contain configuration files or their backups:
pl_pl: Pod następującymi adresami znajdują się pliki konfiguracyjne lub ich kopie zapasowe:

source: Such files shouldn't be publicly available as they may contain passwords or other types of information that can be used to compromise the system.
pl_pl: Rekomendujemy, aby takie pliki nie były dostępne publicznie, gdyż mogą zawierać hasła dostępowe lub inne informacje, które mogą zostać wykorzystane do ataku na Państwa systemy.

source: The following files contain e-mails that the system failed to send:
pl_pl: Pod następującymi adresami znajdują się pliki z treściami nieskutecznie wysłanych e-maili:

source: Such data shouldn't be publicly accessible.
pl_pl: Rekomendujemy, aby takie pliki nie były dostępne publicznie.

source: The following addresses may contain information about the names of files or directories on the server:
pl_pl: Pod następującymi adresami mogą znajdować się informacje o nazwach niektórych plików lub folderów, które są obecne na serwerze:

source: Such information shouldn't be publicly available as it may allow an attacker to gain information about the website, and in some cases - learn the names of e.g. backup files or other files that shouldn't be publicly available.
pl_pl: Rekomendujemy, aby takie informacje nie były dostępne publicznie, gdyż mogą ułatwiać atakującemu zdobycie informacji na temat strony, a w niektórych przypadkach zdobycie informacji np. o nazwach kopii zapasowych czy innych plików, które nie powinny być dostępne publicznie.

source: The following addresses contain HTTP server status pages:
pl_pl: Pod następującymi adresami znajdują się strony z informacjami o konfiguracji lub działaniu serwera HTTP:

source: Such endpoints shouldn't be publicly accessible.
pl_pl: Rekomendujemy, aby takie końcówki nie były publicznie dostępne.

source: The following addresses contain private cryptographic keys:
pl_pl: Pod następującymi adresami znajdują się prywatne klucze kryptograficzne:

source: The following addresses contain logs:
pl_pl: Pod następującymi adresami znajdują się pliki logów:

source: Such files shouldn't be publicly accessible as they may contain personal identifiable information, information that allows unauthorized access (such as session identifiers), configuration data or other types of information that shouldn't be publicly accessible.
pl_pl: Rekomendujemy, aby takie pliki nie były dostępne publicznie, gdyż mogą zawierać dane osobowe, informacje umożliwiające nieuprawniony dostęp do systemu (takie jak np. identyfikatory sesji), dane na temat konfiguracji systemu lub inne informacje, które nie powinny być dostępne publicznie.

source: The following files contain passwords or password hashes:
pl_pl: Pod następującymi adresami znajdują się pliki z hasłami lub ich haszami:

source: The following addresses contain PHP source code that is not interpreted by the server.
pl_pl: Pod następującymi adresami znajdują się pliki zawierające kod źródłowy PHP, który nie jest interpretowany przez serwer:

source: Making such information publicly available can allow an attacker to learn about the internals of software used, and if such files contain passwords - also gain unauthorized access. Such files shouldn't be publicly accessible.
pl_pl: Udostępnienie takich informacji umożliwi atakującemu lepsze poznanie użytego oprogramowania, a jeśli zawarte są tam też hasła - również uzyskanie nieuprawnionego dostępu. Rekomendujemy, aby takie informacje nie były publicznie dostępne.

source: The following addresses contain PHP data dumps, e.g. generated by the var_dump function:
pl_pl: Pod następującymi adresami w kodzie strony znajduje się zrzut danych PHP, np. generowany przez funkcję var_dump:

source: Please verify whether such data should be publicly available.
pl_pl: Prosimy o sprawdzenie, czy takie dane powinny być dostępne publicznie.

source: The following addresses contain information about server configuration:
pl_pl: Pod następującymi adresami znajdują się pliki udostępniające informacje o konfiguracji serwera:

source: Making such information publicly available will allow an attacker to learn about server configuration, paths, and - if environment variables contain passwords or API keys - gain unauthorized access. Such information shouldn't be publicly available.
pl_pl: Udostępnienie takich informacji umożliwi atakującemu dokładne poznanie konfiguracji serwera i ścieżek, a jeśli np. w zmiennych środowiskowych znajdują się hasła czy klucze API - również uzyskanie nieuprawnionego dostępu. Rekomendujemy, aby takie informacje nie były publicznie dostępne.

source: The following files contain database dumps:
pl_pl: Pod następującymi adresami znajdują się zrzuty bazy danych:
