Repository: CERT-Polska/Artemis
Catalog: artemis/reporting/modules/sql_injection_detector/translations/*/LC_MESSAGES/messages.po
Languages: pl_pl

source: We identified that the following URLs are exposed to SQL Injection or Time Base SQL Injection:
pl_pl: Zidentyfikowaliśmy, że następujące adresy URL są podatne na SQL Injection lub Time-Based SQL Injection:

source: It appears that this url is vulnerable to SQL Injection
pl_pl: Wygląda na to, że ten adres URL jest podatny na atak typu SQL Injection

source: It appears that this url is vulnerable to SQL Time Base Injection
pl_pl: Wygląda na to, że ten adres URL jest podatny na atak typu SQL Time-Based Injection

source: It appears that this url is vulnerable to SQL Injection through HTTP Headers
pl_pl: Wygląda na to, że ten adres URL jest podatny na atak SQL Injection przez nagłówki HTTP

source: It appears that this url is vulnerable to SQL Time Base Injection through HTTP Headers
pl_pl: Wygląda na to, że ten adres URL jest podatny na atak SQL Time-Based Injection przez nagłówki HTTP

source: Response from server is equal to 500
pl_pl: Odpowiedź z serwera równa się 500

source: These vulnerabilities can lead to serious security breaches, including user data leaks and potential database manipulation. The vulnerability occurs when dangerous user input is directly injected into SQL queries, allowing attackers to execute any SQL commands.
pl_pl: Te podatności mogą prowadzić do poważnych naruszeń bezpieczeństwa, w tym wycieku danych użytkowników i potencjalnej manipulacji bazą danych. Podatność występuje, gdy niebezpieczne dane wejściowe użytkownika są bezpośrednio wstrzykiwane do zapytań SQL, co umożliwia atakującym wykonanie dowolnych poleceń SQL.

source: Effects of the vulnerability:
pl_pl: Skutki podatności:

source: Possibility of leaking personal user data.
pl_pl: Możliwość wycieku danych osobowych użytkowników.

source: Manipulation of data in the database.
pl_pl: Manipulacja danymi w bazie danych.

source: Possibility of complete control over the database.
pl_pl: Możliwość całkowitego przejęcia kontroli nad bazą danych.

source: We recommend:
pl_pl: Rekomendujemy

source: Validation and sanitization of input data.
pl_pl: Walidacja i sanityzacja danych wejściowych.

source: Using prepared statements and stored procedures.
pl_pl: Używanie przygotowanych zapytań i procedur składowanych.

source: Limiting database permissions.
pl_pl: Ograniczanie uprawnień do bazy danych.
