Repository: CERT-Polska/Artemis
Catalog: artemis/reporting/modules/mail_dns_scanner/translations/*/additional.po
Languages: pl_pl

source: SPF ~all or -all directive not found
pl_pl: Nie znaleziono dyrektywy ~all lub -all w rekordzie SPF

source: Valid SPF record not found
pl_pl: Nie znaleziono poprawnego rekordu SPF

source: Multiple SPF records found
pl_pl: Wykryto wiele rekordów SPF

source: SPF record not found in domain referenced from other SPF record
pl_pl: Nie znaleziono rekordu SPF w domenie do której odwołuje się rekord SPF

source: SPF record causes too many void DNS lookups
pl_pl: Rekord SPF powoduje zbyt wiele zapytań DNS o nieistniejące rekordy A i MX

source: SPF record includes an endless loop
pl_pl: Rekord SPF zawiera nieskończoną pętlę

source: SPF record is not syntatically correct
pl_pl: Rekord SPF nie ma poprawnej składni

source: SPF record includes too many DNS lookups
pl_pl: Rekord SPF zawiera zbyt wiele zapytań DNS

source: The ptr mechanism should not be used - https://tools.ietf.org/html/rfc7208#section-5.5
pl_pl: Zgodnie z https://tools.ietf.org/html/rfc7208#section-5.5 nie należy używać mechanizmu ptr

source: Valid DMARC record not found
pl_pl: Nie znaleziono poprawnego rekordu DMARC

source: DMARC policy is none and rua is not set, which means that the DMARC setting is not effective.
pl_pl: Polityka DMARC jest ustawiona na 'none' i nie ustawiono odbiorcy raportów w polu 'rua' co oznacza, że ustawienie DMARC nie będzie skuteczne.

source: DMARC record should be stored in the `_dmarc` subdomain
pl_pl: Rekord DMARC powinien się znajdować w subdomenie '_dmarc'

source: There are multiple DMARC records
pl_pl: Wykryto więcej niż jeden rekord DMARC

source: There is a SPF record instead of DMARC one
pl_pl: Zamiast rekordu DMARC wykryto rekord SPF

source: DMARC record is not syntatically correct
pl_pl: Rekord DMARC nie ma poprawnej składni

source: DMARC record uses an invalid tag
pl_pl: Rekord DMARC używa niepoprawnego tagu

source: DMARC report URI is invalid
pl_pl: Adres raportów DMARC jest niepoprawny

source: The destination of a DMARC report URI does not indicate that it accepts reports for the domain
pl_pl: Polityka subdomen (sp=) powinna być ustawiona na 'reject' dla domen niesłużących do wysyłki poczty

source: Policy (p=) should be reject for parked domains
pl_pl: Polityka (p=) powinna być ustawiona na 'reject' dla domen niesłużących do wysyłki poczty

source: Unrelated TXT record found
pl_pl: Znaleziono niepowiązane rekordy TXT

source: A email address in a DMARC report URI is missing MX records
pl_pl: Domena adresu e-mail w adresie raportów DMARC nie zawiera rekordów MX

source: DMARC policy is none which means that besides reporting no action will be taken
pl_pl: Polityka DMARC jest ustawiona na 'none', co oznacza, że oprócz raportowania, żadna dodatkowa akcja nie zostanie wykonana

source: rua tag (destination for aggregate reports) not found
pl_pl: Nie znaleziono tagu 'rua' (odbiorca zagregowanych raportów)

source: Whitespace in domain name detected
pl_pl: Wykryto białe znaki w nazwie domeny
