Repository: CERT-Polska/Artemis
Catalog: artemis/reporting/modules/api_scanner/translations/*/LC_MESSAGES/messages.po
Languages: pl_pl

source: We identified following API vulnerabilities:
pl_pl: Wykryliśmy następujące podatności w końcówkach API:

source: the endpoint accepts HTTP methods that is not documented as allowed, potentially enabling unintended operations
pl_pl: końcówka akceptuje metody HTTP które nie są udokumentowane, potencjalnie umożliwiając nieuprawnione operacje

source: SQL Injection - malicious input can manipulate database queries, leading to data leaks or unauthorized access
pl_pl: SQL Injection - atakujący może manipulować zapytaniami do bazy danych, co umożliwia pobranie danych lub nieuprawniony dostęp do systemu

source: time-based SQL Injection - an attacker can infer data using timing-based payloads, exploiting database behavior
pl_pl: SQL Injection - atakujący może manipulować zapytaniami do bazy danych, co umożliwia pobranie danych lub nieuprawniony dostęp do systemu

source: OS Command Injection - arbitrary system commands can be executed on the server, leading to full compromise
pl_pl: wstrzykiwanie poleceń systemowych - atakujący może wykonać dowolne polecenia na serwerze, uzyskując pełny dostęp do systemu

source: XSS/HTML Injection - untrusted input is rendered in the browser, enabling attacks such as session hijacking or defacement. In the case of defacement, reflected XSS allows an attacker to inject and execute arbitrary HTML or JavaScript, altering the appearance or content of the affected page for the victim, effectively impersonating the administrator or changing site behavior
pl_pl: Cross-Site Scripting - niezaufana treść jest wyświetlana/wykonywana w przeglądarce internetowej, co umożliwia atakującemu spreparowanie linku, który, po kliknięciu przez administratora, wykona dowolną akcję z jego uprawnieniami (taką jak np. modyfikacja treści czy kradzież danych)

source: SSTI - Server-Side Template Injection allows attackers to execute code on the server by injecting into templates
pl_pl: Server-Side Template Injection - atakujący może wstrzykiwać własną zawartość szablonów HTML a dzięki temu wykonywać kod na serwerze

source: missing authentication - endpoints lack proper access control, allowing unauthorized access
pl_pl: brak uwierzytelnienia - końcówka nie weryfikuje, czy użytkownik jest uprawniony do jej uruchomienia, co może prowadzić do nieuprawnionego dostępu do systemu

source: method:
pl_pl: metoda:

source: status code:
pl_pl: kod odpowiedzi:
